src/bsl/InformationRegisters/гкс_ОчередьОбработкиВходящихДанныхWarehouse.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_ОчередьОбработкиВходящихДанныхWarehouse</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоНеудачныхОбработок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СообщениеОбОшибкеОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВходящиеДанные</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ВходящиеДанныеWarehouse</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_ОчередьОбработкиВходящихДанныхWarehouse/Ext/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает выборку из регистра.
//
// Возвращаемое значение:
//  ВыборкаРезультатаЗапроса - включает все поля регистра:
// 		*Порядок - Число - порядок в очереди
// 		*ВходящиеДанные - СправочникСсылка.гкс_ВходящиеДанныеWarehouse - данные для обработки
// 		*КоличествоНеудачныхОбработок - Число - неудачные попытки
// 		*СообщениеОбОшибкеОбработки - Строка - Описание ошибки.
//
Функция ВыборкаИзОчереди(ПараметрыОбработки = Неопределено) Экспорт

	ПроверитьИЗаполнитьПараметрыОбработки(ПараметрыОбработки);

	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаВходящиеДанныеПоОчереди(ПараметрыОбработки);
	Запрос.УстановитьПараметр("КоличествоНеудачныхОбработок", ПараметрыОбработки.КоличествоНеудачныхОбработок);

	Возврат Запрос.Выполнить().Выбрать();

КонецФункции

// Создает структуру, содержащую имена и значения измерений, ресурсов и реквизитов регистра сведений.
//
// Возвращаемое значение:
//  Структура - коллекция измерений ресурсов и реквизитов.
//
Функция СтруктураЗаписи() Экспорт

	Возврат ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(СоздатьМенеджерЗаписи(),
							Метаданные.РегистрыСведений.гкс_ОчередьОбработкиВходящихДанныхWarehouse);

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПараметрыОбработкиПоУмолчанию()

	ПараметрыОбработки = Новый Структура;
	ПараметрыОбработки.Вставить("КоличествоНеудачныхОбработок", 	3);
	ПараметрыОбработки.Вставить("РазмерПорцииОбработки", 			100);

	Возврат ПараметрыОбработки;

КонецФункции

Процедура ПроверитьИЗаполнитьПараметрыОбработки(ПараметрыОбработки)

	ПараметрыПоУмолчанию = ПараметрыОбработкиПоУмолчанию();

	Если ПараметрыОбработки = Неопределено Тогда
		ПараметрыОбработки = ПараметрыПоУмолчанию;
		Возврат;
	КонецЕсли;

	ЗаполнитьКоличествоНеудачных =
		ПараметрыОбработки.Свойство("КоличествоНеудачныхОбработок")
		И Не ЗначениеЗаполнено(ПараметрыОбработки.КоличествоНеудачныхОбработок);

	Если ЗаполнитьКоличествоНеудачных Тогда
		ПараметрыОбработки.КоличествоНеудачныхОбработок = ПараметрыПоУмолчанию.КоличествоНеудачныхОбработок;
	КонецЕсли;

	ЗаполнитьРазмерПорции =
		ПараметрыОбработки.Свойство("РазмерПорцииОбработки")
		И Не ЗначениеЗаполнено(ПараметрыОбработки.РазмерПорцииОбработки);

	Если ЗаполнитьРазмерПорции Тогда
		ПараметрыОбработки.РазмерПорцииОбработки = ПараметрыПоУмолчанию.РазмерПорцииОбработки;
	КонецЕсли;

КонецПроцедуры

// Добавляет входяшие данные в очередь обработки.
//
// Параметры:
//  ВходящиеДанные - СправочникСсылка.гкс_ВходящиеДанныеWarehouse - данные для обработки
//  ДатаСоздания - Дата - создания
//
Процедура ЗафиксироватьНовыеВходящиеДанныеВОчереди(ВходящиеДанные, ДатаСоздания) Экспорт

	СтруктураЗаписи = СтруктураЗаписи();
	СтруктураЗаписи.Вставить("ВходящиеДанные", 	ВходящиеДанные);
	СтруктураЗаписи.Вставить("Порядок", 		ТекущаяУниверсальнаяДатаВМиллисекундах());
	СтруктураЗаписи.Вставить("ДатаСоздания", 	ДатаСоздания);

	гкс_ОбменДаннымиСервер.ДобавитьЗаписьВРегистрСведений(
		СтруктураЗаписи,
		"гкс_ОчередьОбработкиВходящихДанныхWarehouse");

КонецПроцедуры

// Добавляет входяшие данные в очередь обработки.
//
// Параметры:
//  СтруктураЗаписи - см. описание в СтруктураЗаписи()
//
Процедура ЗафиксироватьИзмененияВходящихДанныхВОчереди(СтруктураЗаписи) Экспорт

	гкс_ОбменДаннымиСервер.ДобавитьЗаписьВРегистрСведений(
		СтруктураЗаписи,
		"гкс_ОчередьОбработкиВходящихДанныхWarehouse");

КонецПроцедуры

// Исключает входяшие данные из очереди обработки.
//
// Параметры:
//  ВходящиеДанные - СправочникСсылка.гкс_ВходящиеДанныеWarehouse - данные для обработки
//  Порядок - Число - необязательный параметр отбора
//
Процедура УдалитьОбработкуВходящихДанныхВОчереди(ВходящиеДанные, Порядок = Неопределено) Экспорт

	СтруктураЗаписи = Новый Структура;
	СтруктураЗаписи.Вставить("ВходящиеДанные", ВходящиеДанные);
	Если Не Порядок = Неопределено Тогда
		СтруктураЗаписи.Вставить("Порядок", Порядок);
	КонецЕсли;

	гкс_ОбменДаннымиСервер.УдалитьНаборЗаписейВРегистреСведений(
		СтруктураЗаписи,
		"гкс_ОчередьОбработкиВходящихДанныхWarehouse");

КонецПроцедуры

Функция ВыбратьЗапистьПоОтбору(ОсновнойОтбор) Экспорт

	ЗаписьМенеджер = СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(ЗаписьМенеджер, ОсновнойОтбор);
	ЗаписьМенеджер.Прочитать();

	СтруктураЗаписи = ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(ЗаписьМенеджер,
							Метаданные.РегистрыСведений.гкс_ОчередьОбработкиВходящихДанныхWarehouse);

	//Если ЗаписьМенеджер.Выбран() Тогда
	//    ЗаполнитьЗначенияСвойств(СтруктураЗаписи, ЗаписьМенеджер);
	//КонецЕсли;

	Возврат СтруктураЗаписи;

КонецФункции

#Область ТекстыЗапросов

Функция ТекстЗапросаВходящиеДанныеПоОчереди(ПараметрыОбработки)

	РазмерСтрокой = Формат(ПараметрыОбработки.РазмерПорцииОбработки, "ЧГ=100");

	ТекстЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 100
	|	ОчередьОбработки.Порядок КАК Порядок,
	|	ОчередьОбработки.ВходящиеДанные КАК ВходящиеДанные,
	|	ОчередьОбработки.КоличествоНеудачныхОбработок КАК КоличествоНеудачныхОбработок,
	|	ОчередьОбработки.СообщениеОбОшибкеОбработки КАК СообщениеОбОшибкеОбработки,
	|	ОчередьОбработки.ДатаСоздания КАК ДатаСоздания
	|ИЗ
	|	РегистрСведений.гкс_ОчередьОбработкиВходящихДанныхWarehouse КАК ОчередьОбработки
	|ГДЕ
	|	ОчередьОбработки.КоличествоНеудачныхОбработок <= &КоличествоНеудачныхОбработок
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок";

	СтрокаПоиска = "ПЕРВЫЕ 100";
	СтрокаЗамены = СтрШаблон("ПЕРВЫЕ %1", РазмерСтрокой);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, СтрокаПоиска, СтрокаЗамены);

	Возврат ТекстЗапроса;

КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
